[
    {
        "type": "NonPlayableRoom",
        "id": 1,
        "name": "...",
        "description": "Faticosamente riprendi i sensi...il freddo pavimento sotto il tuo volto.<br><br>Cerchi di ricordare cosa ti ha condotto fino a lì: lo squillo del telefono, la tua amica Valeria che si rifaceva viva - praticamente non la sentivi da sei mesi - chiedendoti di raggiungerla nella sua futura residenza, un vecchio palazzo chiamato Villa Morgana; voleva mostrarti una cosa interessante - diceva lei - ma il tono nervoso della sua voce ti aveva messo in allarme.<br><br>Poi il viaggio, la tua auto che si fermava davanti al cancello della villa, nessuna risposta al tuo bussare; il portone era stranamente aperto. Sei entrato, preoccupato per Valeria, muovendo i tuoi passi lungo il corridoio e le stanze vicine, cercandola e chiamandola.<br><br>Di colpo tutto intorno a te ha iniziato a girare e il buio ti ha avvolto.<br><br>Ti risvegli, lasci che i tuoi occhi si abituino alla poca luce che filtra in qualche modo all'interno e ti guardi attorno. Polvere, finestre murate, pareti e mobilio in rovina. Sei sempre all'interno della Villa. Ma la Villa in qualche modo è cambiata.<br><br> [ . . . ]",
        "imgPath": "./resources/img/intro.jpg",
        "nextRoomId": 2
    },
    {
        "type": "PlayableRoom",
        "id": 2,
        "name": "TestEast",
        "description": "TestDescriptionEast",
        "visible": true,
        "southId": 0,
        "northId": 0,
        "eastId": 0,
        "westId": 1,
        "objects": [
            {
                "type": "AdvObject",
                "id": 1,
                "name": "batteria",
                "description": "Un pacco di batterie, chissà se sono cariche.",
                "alias": [
                    "pile",
                    "pila",
                    "batterie"
                ],
                "openable": false,
                "pickupable": true,
                "pushable": false,
                "open": false,
                "push": false
            },
            {
                "type": "AdvObjectContainer",
                "list": [
                    {
                        "type": "AdvObject",
                        "id": 3,
                        "name": "qualcosa",
                        "description": "non so",
                        "openable": false,
                        "pickupable": true,
                        "pushable": false,
                        "open": false,
                        "push": false
                    }
                ],
                "id": 2,
                "name": "armadio",
                "description": "Un semplice armadio.",
                "alias": [
                    "guardaroba",
                    "vestiario"
                ],
                "openable": true,
                "pickupable": false,
                "pushable": false,
                "open": false,
                "push": false
            }
        ]
    }
]